Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.5/phy/source/MKW41Z/PhyPacketProcessor.c
    /* Avoid unaligned memory access issues */
    FLib_MemCpy(&value, pShortAddr, sizeof(value));
    
    if( pan == 0 )
    {
        ZLL->MACSHORTADDRS0 &= ~ZLL_MACSHORTADDRS0_MACSHORTADDRS0_MASK;
        ZLL->MACSHORTADDRS0 |= ZLL_MACSHORTADDRS0_MACSHORTADDRS0(value);
    }
    else
    {
        ZLL->MACSHORTADDRS1 &= ~ZLL_MACSHORTADDRS1_MACSHORTADDRS1_MASK;
        ZLL->MACSHORTADDRS1 |= ZLL_MACSHORTADDRS1_MACSHORTADDRS1(value);
    }

    return gPhySuccess_c;
}

/*! *********************************************************************************
* \brief  Set the value of the MAC extended address
*
* \param[in]  pLongAddr
* \param[in]  pan
*
* \return  phyStatus_t
*
********************************************************************************** */
phyStatus_t PhyPpSetLongAddr
(
uint8_t *pLongAddr,
uint8_t pan
)
{
    uint32_t addrLo;
    uint32_t addrHi;

#ifdef PHY_PARAMETERS_VALIDATION
    if(NULL == pLongAddr)
    {
        return gPhyInvalidParameter_c;
    }
#endif /* PHY_PARAMETERS_VALIDATION */

    /* Avoid unaligned memory access issues */
    FLib_MemCpy(&addrLo, pLongAddr, sizeof(addrLo));
    pLongAddr += sizeof(addrLo);
    FLib_MemCpy(&addrHi, pLongAddr, sizeof(addrHi));

    if( 0 == pan )
    {
        ZLL->MACLONGADDRS0_LSB = addrLo;
        ZLL->MACLONGADDRS0_MSB = addrHi;
    }
    else
    {
        ZLL->MACLONGADDRS1_LSB = addrLo;
        ZLL->MACLONGADDRS1_MSB = addrHi;
    }

    return gPhySuccess_c;
}

/*! *********************************************************************************
* \brief  Set the MAC PanCoordinator role
*
* \param[in]  macRole
* \param[in]  pan
*
* \return  phyStatus_t
*
********************************************************************************** */
phyStatus_t PhyPpSetMacRole
(
  bool_t macRole,
  uint8_t pan
)
{
    uint8_t panCoord;

    if(gMacRole_PanCoord_c == macRole)
    {
        panCoord = 1;
    }
    else
    {
        panCoord = 0;
    }

    if( 0 == pan )
    {
        ZLL->PHY_CTRL &= ~ZLL_PHY_CTRL_PANCORDNTR0_MASK;
        ZLL->PHY_CTRL |= ZLL_PHY_CTRL_PANCORDNTR0(panCoord);
    }
    else
    {
        ZLL->DUAL_PAN_CTRL &= ~ZLL_DUAL_PAN_CTRL_PANCORDNTR1_MASK;
        ZLL->DUAL_PAN_CTRL |= ZLL_DUAL_PAN_CTRL_PANCORDNTR1(panCoord);
    }

    return gPhySuccess_c;
}

/*! *********************************************************************************
* \brief  Set the PHY in Promiscuous mode
*
* \param[in]  mode
*
********************************************************************************** */
void PhyPpSetPromiscuous(bool_t mode)
{
    if( mode )
    {
        ZLL->PHY_CTRL |= ZLL_PHY_CTRL_PROMISCUOUS_MASK;
        /* FRM_VER[11:8] = b1111. Any Frame version/type accepted */
        ZLL->RX_FRAME_FILTER |= (ZLL_RX_FRAME_FILTER_FRM_VER_FILTER_MASK  |
                                 ZLL_RX_FRAME_FILTER_EXTENDED_FT_MASK     |
                                 ZLL_RX_FRAME_FILTER_MULTIPURPOSE_FT_MASK |
                                 ZLL_RX_FRAME_FILTER_LLDN_FT_MASK         |
                                 ZLL_RX_FRAME_FILTER_CMD_FT_MASK          |
                                 ZLL_RX_FRAME_FILTER_DATA_FT_MASK         |
                                 ZLL_RX_FRAME_FILTER_BEACON_FT_MASK       |
                                 ZLL_RX_FRAME_FILTER_ACK_FT_MASK          |
                                 ZLL_RX_FRAME_FILTER_NS_FT_MASK);
    }
    else
    {
        ZLL->PHY_CTRL &= ~ZLL_PHY_CTRL_PROMISCUOUS_MASK;
        /* FRM_VER[11:8] = b0011. Accept FrameVersion 0 and 1 packets, reject all others */
        /* Beacon, Data and MAC command frame types accepted */
        ZLL->RX_FRAME_FILTER = mDefaultRxFiltering;
    }
}

/*! *********************************************************************************
* \brief  Set the PHY in ActivePromiscuous mode
*
* \param[in]  state
*
********************************************************************************** */
void PhySetActivePromiscuous(bool_t state)
{
    if( state )
    {
        if( ZLL->PHY_CTRL & ZLL_PHY_CTRL_PROMISCUOUS_MASK )
        {
            /* Disable Promiscuous mode */
            ZLL->PHY_CTRL &= ~ZLL_PHY_CTRL_PROMISCUOUS_MASK;
            ZLL->RX_FRAME_FILTER |= ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_MASK;
        }
    }
    else
    {
        if( ZLL->RX_FRAME_FILTER & ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_MASK )
        {
            ZLL->RX_FRAME_FILTER &= ~ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_MASK;
            /* Enable Promiscuous mode */
            ZLL->PHY_CTRL |= ZLL_PHY_CTRL_PROMISCUOUS_MASK;
        }
    }
}

/*! *********************************************************************************
* \brief  Get the state of the ActivePromiscuous mode
*
* \return  bool_t state
*
********************************************************************************** */
bool_t PhyGetActivePromiscuous
(
void
)
{
    return !!(ZLL->RX_FRAME_FILTER & ZLL_RX_FRAME_FILTER_ACTIVE_PROMISCUOUS_MASK);
}

/*! *********************************************************************************
* \brief  Set the state of the SAM HW module
*
* \param[in]  state
*
********************************************************************************** */
void PhyPpSetSAMState
(
  bool_t state
)
{
    ZLL->SAM_CTRL &= ~ZLL_SAM_CTRL_SAP0_EN_MASK;
    ZLL->SAM_CTRL |= ZLL_SAM_CTRL_SAP0_EN(state);
#if gMpmIncluded_d
    ZLL->SAM_CTRL &= ~ZLL_SAM_CTRL_SAP1_EN_MASK;
    ZLL->SAM_CTRL |= ZLL_SAM_CTRL_SAP1_EN(state);
#endif
}

/*! *********************************************************************************
* \brief  Add a new element to the PHY indirect queue
*
* \param[in]  index
* \param[in]  checkSum
* \param[in]  instanceId
*
* \return  phyStatus_t
*
********************************************************************************** */
phyStatus_t PhyPp_IndirectQueueInsert
(
uint8_t  index,
uint16_t checkSum,
instanceId_t instanceId
)
{
    uint32_t temp;
    phyStatus_t status = gPhySuccess_c;

    instanceId = instanceId;
    if( index >= gPhyHwIndQueueSize_d )
    {
        status = gPhyInvalidParameter_c;
    }
    else
    {
        temp = ZLL->SAM_TABLE;
        temp &= ~(ZLL_SAM_TABLE_SAM_INDEX_MASK | ZLL_SAM_TABLE_SAM_CHECKSUM_MASK);
        
        temp |= ((uint32_t)index << ZLL_SAM_TABLE_SAM_INDEX_SHIFT) |
                ((uint32_t)checkSum << ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT) |
                 ZLL_SAM_TABLE_SAM_INDEX_WR_MASK | ZLL_SAM_TABLE_SAM_INDEX_EN_MASK;
        ZLL->SAM_TABLE = temp;
    }

