Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.5/phy/source/MKW41Z/PhyPacketProcessor.c
    index = (ZLL->SAM_FREE_IDX & ZLL_SAM_FREE_IDX_SAA0_1ST_FREE_IDX_MASK) >> ZLL_SAM_FREE_IDX_SAA0_1ST_FREE_IDX_SHIFT;

    if( (index >= min) && (index < max) )
    {
        PhyPp_IndirectQueueInsert((uint8_t)index, checksum, 0);
        return 0;
    }
#endif
    return 1;
}

/*! *********************************************************************************
* \brief  This function removes an 802.15.4 device to the neighbor table.
*         If a polling device is not in the neighbor table, the ACK will have FP=1
*
* \param[in]  pAddr     Pointer to an 802.15.4 address
* \param[in]  addrMode  The 802.15.4 addressing mode
* \param[in]  PanId     The 802.15.2 PAN Id
*
********************************************************************************** */
uint8_t PhyRemoveFromNeighborTable(uint8_t *pAddr, uint8_t addrMode, uint16_t PanId)
{
#if gPhyUseNeighborTable_d
    uint16_t checksum;
    int32_t  index;

    checksum = PhyGetChecksum(pAddr, addrMode, PanId);
    index    = PhyGetIndexOf(checksum);
    
    if( index != -1 )
    {
        /* Invalidate current index and checksum */
        PhyPp_RemoveFromIndirect(index,0);
        return 0;
    }
#endif
    return 1;
}

/*! *********************************************************************************
* \brief  Invalidate all entries from the Neighbour Table
*
********************************************************************************** */
void PhyResetNeighborTable(void)
{
#if gPhyUseNeighborTable_d
    uint32_t min = (ZLL->SAM_CTRL & ZLL_SAM_CTRL_SAA0_START_MASK) >> ZLL_SAM_CTRL_SAA0_START_SHIFT;
    uint32_t max = gPhyHwIndQueueSize_d;
    uint32_t i;
    
    for (i=min; i< max; i++)
    {
        PhyPp_RemoveFromIndirect(i,0);
    }
#endif
}

/*! *********************************************************************************
* \brief  This function checks if an 802.15.4 device is in the neighbor table.
*         If a polling device is not in the neighbor table, the ACK will have FP=1
*
* \param[in]  checksum     hash code generated by PhyGetChecksum()
*
* \return  TRUE if the device is present in the neighbor table, FALSE if not.
*
********************************************************************************** */
bool_t PhyCheckNeighborTable(uint16_t checksum)
{
#if gPhyUseNeighborTable_d
    if( PhyGetIndexOf(checksum) != -1 )
    {
        return TRUE;
    }
#endif
    return FALSE;
}

/*! *********************************************************************************
* \brief  This function returns the table index of the specified checksum.
*
* \param[in]  checksum     hash code generated by PhyGetChecksum()
*
* \return  The table index where the checksum was found or
*          -1 if no entry was found with the specified chacksum
*          
*
********************************************************************************** */
#if gPhyUseNeighborTable_d
static int32_t PhyGetIndexOf( uint16_t checksum )
{
    uint32_t i, phyReg;
    uint32_t start = (ZLL->SAM_CTRL & ZLL_SAM_CTRL_SAA0_START_MASK) >> ZLL_SAM_CTRL_SAA0_START_SHIFT;
    uint32_t stop = gPhyHwIndQueueSize_d;
    
    for(i=start; i<stop; i++)
    {
        /* Set the index value */
        phyReg = ZLL->SAM_TABLE;
        phyReg &= ~(ZLL_SAM_TABLE_SAM_INDEX_MASK     |
                    ZLL_SAM_TABLE_SAM_INDEX_WR_MASK  |
                    ZLL_SAM_TABLE_SAM_INDEX_INV_MASK |
                    ZLL_SAM_TABLE_SAM_INDEX_EN_MASK  |
                    ZLL_SAM_TABLE_FIND_FREE_IDX_MASK |
                    ZLL_SAM_TABLE_INVALIDATE_ALL_MASK );
        
        ZLL->SAM_TABLE = phyReg | (i << ZLL_SAM_TABLE_SAM_INDEX_SHIFT);
        /* Read checksum located at the specified index */
        phyReg = ZLL->SAM_TABLE;
        phyReg = (phyReg & ZLL_SAM_TABLE_SAM_CHECKSUM_MASK) >> ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT;

        if( phyReg == checksum )
        {
            return i;
        }
    }
    
    return -1;
}
#endif

/*! *********************************************************************************
* \brief  Change the XCVR DSM duration
*
* \param[in]  duration  the new XCVR sleep duration
*
********************************************************************************** */
void PhyPlmeSetDSMDuration(uint32_t duration)
{
    /* Minimum DSM duration */
    mPhyDSMDuration = RSIM->DSM_OSC_OFFSET + mPhyDSM_GuardTime_d;
    
    if( duration > mPhyDSMDuration )
    {
        mPhyDSMDuration = duration;
    }
}

/*! *********************************************************************************
* \brief  Change the XCVR power state
*
* \param[in]  state  the new XCVR power state
*
* \return  phyStatus_t
*
********************************************************************************** */
phyStatus_t PhyPlmeSetPwrState( uint8_t state )
{
    phyStatus_t status = gPhySuccess_c;
    static uint8_t mPhyPwrState = gPhyPwrIdle_c;

    /* Parameter validation */
    if( state > gPhyPwrReset_c )
    {
        status = gPhyInvalidParameter_c;
    }
    /* Check if the new power state = old power state */
    else if( state == mPhyPwrState )
    {
        status = gPhyBusy_c;
    }
    else
    {
        switch(state)
        {
        case gPhyPwrIdle_c:
            /* Set XCVR in run mode if not allready */
            if(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK)
            {
                RSIM->ZIG_WAKE = (RSIM->DSM_TIMER + mPhyDSM_GuardTime_d);
                while(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK);
            }
            break;

        case gPhyPwrDSM_c:
            /* Set XCVR in low power mode if not allready */
            if(!(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK))
            {
                uint32_t minTime = (RSIM->DSM_OSC_OFFSET > mPhyDSM_GuardTime_d) ? RSIM->DSM_OSC_OFFSET : mPhyDSM_GuardTime_d;

                RSIM->ZIG_SLEEP = RSIM->DSM_TIMER + minTime;
                RSIM->ZIG_WAKE = RSIM->DSM_TIMER + mPhyDSMDuration;
                RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_ZIG_SYSCLK_REQUEST_EN_MASK |
                                     RSIM_DSM_CONTROL_DSM_TIMER_EN_MASK | 
                                     RSIM_DSM_CONTROL_ZIG_SYSCLK_INTERRUPT_EN_MASK;
            }
            break;

        default:
            status = gPhyInvalidPrimitive_c;
            /* do not change current state */
            state = mPhyPwrState;
            break;
        }
        
        mPhyPwrState = state;
    }
    
    return status;
}